export const genre = [
  {
    name: "Арт",
  },
  {
    name: "Безумие",
  },
  {
    name: "Боевик",
  },
  {
    name: "Боевые искусства",
  },
  {
    name: "Вампиры",
  },
  {
    name: "Военные",
  },
  {
    name: "Гарем",
  },
  {
    name: "Гендерная интрига",
  },
  {
    name: "Героическое фентези",
  },
  {
    name: "Демоны",
  },
  {
    name: "Детективы",
  },
  {
    name: "Дзёсей",
  },
  {
    name: "Драма",
  },
  {
    name: "Игра",
  },
  {
    name: "Исекай",
  },
  {
    name: "История",
  },
  {
    name: "Киберпанк",
  },
  {
    name: "Кодомо",
  },
  {
    name: "Комедия",
  },
  {
    name: "Космос",
  },
  {
    name: "Магия",
  },
  {
    name: "Махо-сёдзё",
  },
  {
    name: "Машины",
  },
  {
    name: "Меха",
  },
  {
    name: "Мистика",
  },
  {
    name: "Музыка",
  },
  {
    name: "Научная фантастика",
  },
  {
    name: "Омегаверс",
  },
  {
    name: "Пародия",
  },
  {
    name: "Повседневность",
  },
  {
    name: "Полиция",
  },
  {
    name: "Постапокалипсис",
  },
  {
    name: "Приключения",
  },
  {
    name: "Психология",
  },
  {
    name: "Романтика",
  },
  {
    name: "Самурайский боевик",
  },
  {
    name: "Сверхъестественное",
  },
  {
    name: "Сёдзё",
  },
  {
    name: "Сёнэе",
  },
  {
    name: "Сёнэн-ай",
  },
  {
    name: "Спорт",
  },
  {
    name: "Супер сила",
  },
  {
    name: "Сейнэн",
  },
  {
    name: "Трагедия",
  },
  {
    name: "Триллер",
  },
  {
    name: "Ужасы",
  },
  {
    name: "Фантастика",
  },
  {
    name: "Фэнтези",
  },
  {
    name: "Школа",
  },
  {
    name: "Этти",
  },
];

export const tags = [
  {
    name: "Азартные игры",
  },
  {
    name: "Алхимия",
  },
  {
    name: "Амнезия/Потеря памяти",
  },
  {
    name: "Ангелы",
  },
  {
    name: "Антигерой",
  },
  {
    name: "Антиутопия",
  },
  {
    name: "Апокалипсис",
  },
  {
    name: "Армия",
  },
  {
    name: "Артефакты",
  },
  {
    name: "Боги",
  },
  {
    name: "Бои на мечах",
  },
  {
    name: "Борьба за власть",
  },
  {
    name: "Брат и сестра",
  },
  {
    name: "Будущее",
  },
  {
    name: "Ведьма",
  },
  {
    name: "Вестерн",
  },
  {
    name: "Видеоигры",
  },
  {
    name: "Виртуальная реальность",
  },
  {
    name: "Владыка демонов",
  },
  {
    name: "Военные",
  },
  {
    name: "Войны",
  },
  {
    name: "Волшебники / маги",
  },
  {
    name: "Волшебные существа",
  },
  {
    name: "Воспоминания из другого мира",
  },
  {
    name: "Выживание",
  },
  {
    name: "ГГ женщина",
  },
  {
    name: "ГГ имба",
  },
  {
    name: "ГГ мужчина",
  },
  {
    name: "Геймеры",
  },
  {
    name: "Гильдии",
  },
  {
    name: "Глупый ГГ",
  },
  {
    name: "Гоблины",
  },
  {
    name: "Горничные",
  },
  {
    name: "Гуро",
  },
  {
    name: "Гяру",
  },
  {
    name: "Демоны",
  },
  {
    name: "Драконы",
  },
  {
    name: "Дружба",
  },
  {
    name: "Жестокий мир",
  },
  {
    name: "Животные компаньоны",
  },
];
