export const genre = [
  {
    name: "Арт",
  },
  {
    name: "Безумие",
  },
  {
    name: "Боевик",
  },
  {
    name: "Боевые искусства",
  },
  {
    name: "Вампиры",
  },
  {
    name: "Военные",
  },
  {
    name: "Гарем",
  },
  {
    name: "Гендерная интрига",
  },
  {
    name: "Героическое фентези",
  },
  {
    name: "Демоны",
  },
  {
    name: "Детективы",
  },
  {
    name: "Дзёсей",
  },
  {
    name: "Драма",
  },
  {
    name: "Игра",
  },
  {
    name: "Исекай",
  },
  {
    name: "История",
  },
  {
    name: "Киберпанк",
  },
  {
    name: "Кодомо",
  },
  {
    name: "Комедия",
  },
  {
    name: "Космос",
  },
  {
    name: "Магия",
  },
  {
    name: "Махо-сёдзё",
  },
  {
    name: "Машины",
  },
  {
    name: "Меха",
  },
  {
    name: "Мистика",
  },
  {
    name: "Музыка",
  },
  {
    name: "Научная фантастика",
  },
  {
    name: "Омегаверс",
  },
  {
    name: "Пародия",
  },
  {
    name: "Повседневность",
  },
  {
    name: "Полиция",
  },
  {
    name: "Постапокалипсис",
  },
  {
    name: "Приключения",
  },
  {
    name: "Психология",
  },
  {
    name: "Романтика",
  },
  {
    name: "Самурайский боевик",
  },
  {
    name: "Сверхъестественное",
  },
  {
    name: "Сёдзё",
  },
  {
    name: "Сёнэе",
  },
  {
    name: "Сёнэн-ай",
  },
  {
    name: "Спорт",
  },
  {
    name: "Супер сила",
  },
  {
    name: "Сейнэн",
  },
  {
    name: "Трагедия",
  },
  {
    name: "Триллер",
  },
  {
    name: "Ужасы",
  },
  {
    name: "Фантастика",
  },
  {
    name: "Фэнтези",
  },
  {
    name: "Школа",
  },
  {
    name: "Этти",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const tags = [
  {
    name: "Азартные игры",
  },
  {
    name: "Алхимия",
  },
  {
    name: "Амнезия/Потеря памяти",
  },
  {
    name: "Ангелы",
  },
  {
    name: "Антигерой",
  },
  {
    name: "Антиутопия",
  },
  {
    name: "Апокалипсис",
  },
  {
    name: "Армия",
  },
  {
    name: "Артефакты",
  },
  {
    name: "Боги",
  },
  {
    name: "Бои на мечах",
  },
  {
    name: "Борьба за власть",
  },
  {
    name: "Брат и сестра",
  },
  {
    name: "Будущее",
  },
  {
    name: "Ведьма",
  },
  {
    name: "Вестерн",
  },
  {
    name: "Видеоигры",
  },
  {
    name: "Виртуальная реальность",
  },
  {
    name: "Владыка демонов",
  },
  {
    name: "Военные",
  },
  {
    name: "Войны",
  },
  {
    name: "Волшебники / маги",
  },
  {
    name: "Волшебные существа",
  },
  {
    name: "Воспоминания из другого мира",
  },
  {
    name: "Выживание",
  },
  {
    name: "ГГ женщина",
  },
  {
    name: "ГГ имба",
  },
  {
    name: "ГГ мужчина",
  },
  {
    name: "Геймеры",
  },
  {
    name: "Гильдии",
  },
  {
    name: "Глупый ГГ",
  },
  {
    name: "Гоблины",
  },
  {
    name: "Горничные",
  },
  {
    name: "Гуро",
  },
  {
    name: "Гяру",
  },
  {
    name: "Демоны",
  },
  {
    name: "Драконы",
  },
  {
    name: "Дружба",
  },
  {
    name: "Жестокий мир",
  },
  {
    name: "Животные компаньоны",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const ageRating = [
  {
    name: "Нет",
  },
  {
    name: "12+",
  },
  {
    name: "18+",
  },
  {
    name: "6+",
  },
  {
    name: "16+",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));



export const type = [
  {
    name: "Манга",
  },
  {
    name: "Манхва",
  },
  {
    name: "Руманга",
  },
  {
    name: "OEL-манга",
  },
  {
    name: "Маньхуа",
  },
  {
    name: "Комикс",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const releasedFormat = [
  {
    name: "4-кома(Ёнкома)",
  },
  {
    name: "Додзинси",
  },
  {
    name: "Сингл",
  },
  {
    name: "Вебтун",
  },
  {
    name: "Сборник",
  },
  {
    name: "В цвете",
  },
  {
    name: "Веб",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const status = [
  {
    name: "Онгоинг",
  },
  {
    name: "Анонс",
  },
  {
    name: "Выпуск прекращен",
  },
  {
    name: "Завершен",
  },
  {
    name: "Приостановлен",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const translateStatus = [
  {
    name: "Продолжается",
  },
  {
    name: "Заморожен",
  },
  {
    name: "Завершён",
  },
  {
    name: "Заброшен",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const other = [
  {
    name: "Нет перевода уже 3 месяца",
  },
  {
    name: "Лицензирован",
  },
  {
    name: "Можно приобрести",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

export const myList = [
  {
    name: "Читаю",
  },
  {
    name: "Брошено",
  },
  {
    name: "Любимое",
  },
  {
    name: "В планах",
  },
  {
    name: "Прочитано",
  },
].map((obj, index) => ({ id: index + 1, ...obj }));

